{"pageProps":{"name":"cfp","contents":{"zh":"![cfp](/2021/assets/images/cfp.jpg)\n\n# 议题申请\n\n---\n\n我们欢迎泛 Python 相关的各类投稿，包括在人工智能、Python 特性、网络安全、服务端开发、运维、医疗、金融、开源项目等领域。我们也非常欢迎内容任何对开发者有帮助的闪电演讲。\n\n## 演讲类别\n\n- 主题演讲（35 分钟分享 + 5 分钟在线 Q&A）\n- 闪电演讲（10 分钟）\n\n## 演讲内容审核标准\n\n- 申请人演讲的观点是否明确，所阐述的内容是否吸引人，是否有助于听众在知识和经验方面的积累；\n- 申请人的演讲内容，需以落地实践为出发点，并有助于听众从演讲中挖掘出内容；听众在演讲分享中可能的收获是组委会最关注的，这也是本次 PyCon China 举办的重要意义；\n- 组委会非常欢迎在相应领域有一定成就和从业经验的 Pythonista 提交主题，分享自己的实战经验和观点；\n- PyCon China 注重干货分享和经验交流，请不要试图在演讲时做任何形式的广告。\n\n## 重要日期\n\n- 主题演讲和闪电演讲征稿时间：2021 年 9 月 2 日-2021 年 10 月 2 日\n- 会议举办时间：2021 年 10 月 16 日-10 月 17 日\n\n## 讲师福利\n\n- PyCon China 2021 纪念周边礼包\n\n欢迎申报演讲主题，大会组委会将评审后给予答复。同时欢迎有意向的伙伴，申请成为大会组委会成员，一起举办一场你心中的 PyCon China 大会！\n\n[**视频录制说明**](/2021/video-guide)\n\n<p class=\"has-text-centered\"><a class=\"button is-primary\" href=\"https://jinshuju.net/f/DoStnR\">点此申请</a></p>\n","en":"![cfp](/2021/assets/images/cfp.jpg)\n\n# Call For Papers\n\n---\n\nWe welcome all kinds of presentation related to Python, including artificial intelligence, Python features, network security, server development, operation and maintenance, medical treatment, finance, open source projects and other fields. We also welcome any lightning talks that are helpful to developers.\n\n## Speech category\n\n- Keynote speech (35-45 minutes)\n- Lightning speech (10 minutes)\n\n## Speech content review standard\n\n- Whether the point of view of the applicant’s speech is clear, whether the content described is attractive, and whether it helps the audience to accumulate knowledge and experience;\n- The content of the applicant’s speech should be based on actual practice and help the audience to dig out the content from the speech; the audience’s possible gains from the speech sharing are of the greatest concern to the organizing committee, which is also an important aspect of this PyCon China significance;\n- The organizing committee welcomes Pythonistas who have certain achievements and experience in the corresponding field to submit topics and share their practical experience and opinions;\n- PyCon China pays attention to dry goods sharing and experience exchange. Please do not try to make any form of advertising during the speech.\n\n## Speaker Benefits\n\n- PyCon China 2021 commemorative gift packs.\n\nAt the same time, interested partners are welcome to apply to become members of the conference organizing committee and participate in a PyCon China in your mind!\n\n[**Video Guide**](/2021/en/video-guide)\n\n<p class=\"has-text-centered\"><a class=\"button is-primary\">Click to apply</a></p>\n"}},"__N_SSG":true}