{"pageProps":{"name":"coc","contents":{"zh":"# 行为准则\n\n---\n\nPyCon China 是一个社区组织的会议，旨在倡导 Python 编程语言在中国的使用和应用。它也是一个促进中国 Python 开发者社区之间交流和合作的平台。我们重视 Python 社区每位成员的参与，并希望所有与会者都能有一个愉快和有意义的经历。因此，在整个会议期间和所有与会议相关的活动中，每位参会者都应该对其他参会者表示尊重和礼貌，无论是否由 PyCon China 正式组织。我们明确期望，所有参加 PyCon China 的代表/参会者、演讲者、参展商、组织者和志愿者都必须遵守以下行为准则。组织者将在整个活动期间强制执行该守则。\n\n## 我们的准则\n\nPyCon 致力于为每个人提供积极的会议体验，无论年龄、性别认同和表现、性取向、残疾、外貌、体型、民族、国籍、种族或宗教（或没有宗教）、教育或社会经济地位。\n\n骚扰包括与性别、性取向、残疾、外貌、体型、种族、宗教有关的攻击性口头评论，公共场所的性图像，故意恐吓、跟踪、跟随、骚扰性摄影或录音，持续干扰会谈或其他活动，不适当的身体接触，以及不受欢迎的性关注。我们对任何形式的会议参与者的骚扰行为持零容忍态度，包括但不限于这里提到的活动。\n\n如被要求，应立即停止任何不适当行为。\n\n会场的参展商、赞助商或供应商展位或类似活动也要遵守反骚扰政策。特别地，参展商不应使用性化的图像、活动或其他材料。展位工作人员（包括志愿者）不应使用性化的服装、制服、服饰，或以其他方式创造一个性化的环境。\n\n所有的交流都应该适合专业观众，包括来自许多不同背景的人。性语言或图像不宜出现在会议的所有活动中，包括会谈。请记住，性别歧视、种族主义或任何其他形式的排他性或攻击性笑话或过度的公开脏话不宜出现在 PyCon China 的任何场所。\n\n请勿侮辱或贬低与会者，以及任何违反会议的开放、欢迎和分享精神的行为。在参加会议时，要善待和体谅周围的人，并避免任何形式的攻击性或有辱人格的行为。\n\n如果与会者有违反本行为准则的行为，会议组织者可以采取任何他们认为适当的行动，包括警告违规者或将其开除出会议，并不退还费用。\n\n感谢你的帮助，使得 PyCon China 成为一个对所有人都友好的活动。\n\n## 联系方式\n\n如果您认为有人在 PyCon 活动期间违反了行为准则，或者有任何其他担忧，请立即联系活动工作人员。\n\n会议工作人员将很乐意帮助与会者联系酒店/场地保安或当地执法部门，提供护送服务，或以其他方式协助任何与会者在会议期间感到安全。我们重视您的出席。\n\n如果事情特别紧急，请打电话联系这些人中的任何一个：\n\n- 辛庆（Cynthia Xin） \\\n  电话 / 微信号：185 1609 4658 \\\n  Email：<conference@python-china.org.cn>\n\n## 许可证\n\n本行为准则是由 Python 软件基金会的 PSF 行为准则衍生而来，该准则采用 CC 3.0 Unported 许可证。本行为准则亦采用 CC 3.0 Unported 许可协议进行许可。\n","en":"# Code of Conduct\n\n---\n\nPyCon China is a community organized conference intended for advocating the use and adoption of the Python programming language in China. It is also a platform for fostering networking and collaboration among the Python developer community in China. We value the participation of every member of the Python community and want all attendees to have an enjoyable and rewarding experience. Accordingly, every attendee of the conference is expected to show respect and courtesy to every other attendee throughout the conference and at all conference related events, whether officially organized by PyCon China or not. To make clear what is expected, all delegates/attendees, speakers, exhibitors, organizers and volunteers at PyCon China are required to conform to the following Code of Conduct. Organizers will enforce this code throughout the event.\n\n## Our Rules\n\nPyCon China is dedicated to providing a harassment-free conference experience for everyone, regardless of age, gender, sexual orientation, physical appearance, disability, race, religion or employment.\n\nHarassment includes offensive verbal comments related to gender, sexual orientation, disability, physical appearance, body size, race, religion, sexual images in public spaces, deliberate intimidation, stalking, following, harassing photography or recording, sustained disruption of talks or other events, inappropriate physical contact, and unwelcome sexual attention. We have zero tolerance on harassment of conference participants in any form, including, but not limited to the activities mentioned here.\n\nParticipants asked to stop any harassing behavior are expected to comply immediately.\n\nExhibitors in the expo hall, sponsor or vendor booths, or similar activities are also subject to the anti-harassment policy. In particular, exhibitors should not use sexualized images, activities, or other material. Booth staff (including volunteers) should not use sexualized clothing/uniforms/costumes, or otherwise create a sexualized environment.\n\nAll communication should be appropriate for a professional audience, including people from many different backgrounds. Sexual language or imagery is inappropriate for all aspects of the conference, including talks. Remember that sexist, racist or any other form of exclusionary or offensive jokes or excessive public swearing are not appropriate at any venue of PyCon China.\n\nDo not insult or put down attendees or engage in any action that violates the open, welcoming and sharing spirit of the conference. Be kind and sensitive to the people around you when you are attending the conference, and avoid any kind of offensive or degrading behavior.\n\nIf a participant engages in behavior that violates this code of conduct, the conference organizers may take any action they deem appropriate, including warning the offender or expulsion from the conference with no refund.\n\nThank you for helping to make PyCon China a welcoming, friendly event for all.\n\n## Contact Information\n\nIf you are being harassed, notice that someone else is being harassed, or have any other concerns, please contact an Organizer. Organizer/Volunteer name will be highlighted with the Organizer tag in Hopin Platform or drop an email to report@in.pycon.org. Read more about it in our Reporting Guide\n\nYou may also ask to be put in touch with the Diversity and Inclusion WG chair‚ Sukanya Mandal.\n\nIf the matter is especially urgent, please call/contact any of these individuals:\n\n- Cynthia Xin \\\n  Tel / Wechat: (+86)185 1609 4658 \\\n  Email: <conference@python-china.org.cn>\n\n## License\n\nThis Code of Conduct was forked from PSF Code of Conduct by Python Software Foundation which is under a Creative Commons Attribution 3.0 Unported License. PyCon China Conference Code of Conduct is licensed under a Creative Commons Attribution 3.0 Unported License.\n"}},"__N_SSG":true}