{
  "city_beijing": {
    "address": "<b>Address</b>：(Beijing, eastern city)New Yunnan Crowne Plaza Hotel, Yunan Building, No. 12, Qisheng Middle Street, Northeast Third Ring, Chaoyang District", 
    "agenda": [
      {
        "detail": [
          {
            "time": "09:00-09:20", 
            "topic": "Opening remarks - pay tribute to pythoneer"
          }, 
          {
            "speaker": "id_hongqiangning", 
            "time": "09:20-10:00"
          }, 
          {
            "speaker": "id_eziomelotti", 
            "time": "10:00-10:40"
          }, 
          {
            "time": "10:40-11:20", 
            "topic": "主题待定 【清风 ，币信】"
          }, 
          {
            "speaker": "id_lilong", 
            "time": "11:20-12:00"
          }
        ], 
        "name": "The main venue"
      }, 
      {
        "detail": [
          {
            "speaker": "id_zhangxiang", 
            "time": "13:00-13:45"
          }, 
          {
            "speaker": "id_nightynight", 
            "time": "13:45-14:30"
          }, 
          {
            "speaker": "id_gashero", 
            "time": "14:30-15:15"
          }, 
          {
            "time": "15:15-15:30", 
            "topic": "Tea Break"
          }, 
          {
            "speaker": "id_Lusheng", 
            "time": "15:30-16:15"
          }, 
          {
            "speaker": "id_yaogangqiang", 
            "time": "16:15-17:00"
          }, 
          {
            "speaker": "id_hexiangyu", 
            "time": "17:00-17:15"
          }, 
          {
            "time": "17:15-17:30", 
            "topic": "Ending, Lottery, Taking photo"
          }
        ], 
        "name": "breakout venue 1: Python Language Features"
      }, 
      {
        "detail": [
          {
            "speaker": "id_cuiqingcai", 
            "time": "13:00-13:45"
          }, 
          {
            "speaker": "id_lijinhong", 
            "time": "13:45-14:30"
          }, 
          {
            "speaker": "id_qinxuye", 
            "time": "14:30-15:15"
          }, 
          {
            "time": "15:15-15:30", 
            "topic": "Tea Break"
          }, 
          {
            "speaker": "id_wangshun", 
            "time": "15:30-16:15"
          }, 
          {
            "speaker": "id_chenxiaoyou", 
            "time": "16:15-17:00"
          }, 
          {
            "speaker": "id_yizhe", 
            "time": "17:00-17:15"
          }, 
          {
            "time": "17:15-17:30", 
            "topic": "Ending, Lottery, Taking photo"
          }
        ], 
        "name": "breakout venue 2: Machine Learning & Big Data Session"
      }, 
      {
        "detail": [
          {
            "speaker": "id_heshiyou", 
            "time": "13:00-13:45"
          }, 
          {
            "speaker": "id_kongtaoxun", 
            "time": "13:45-14:30"
          }, 
          {
            "speaker": "id_zhangjintao", 
            "time": "14:30-15:15"
          }, 
          {
            "time": "15:15-15:30", 
            "topic": "Tea Break"
          }, 
          {
            "speaker": "id_dengliangju", 
            "time": "15:30-16:15"
          }, 
          {
            "speaker": "id_lihui", 
            "time": "16:15-17:00"
          }, 
          {
            "speaker": "id_zhouxiaomao", 
            "time": "17:00-17:15"
          }, 
          {
            "time": "17:15-17:30", 
            "topic": "Ending, Lottery, Taking photo"
          }
        ], 
        "name": "breakout venue 3: Web Session ( Web Development / Network Security / Crawler / SDK / API Design )"
      }, 
      {
        "detail": [
          {
            "speaker": "id_changhui", 
            "time": "13:00-13:45"
          }, 
          {
            "speaker": "id_zhaowentian", 
            "time": "13:45-14:30"
          }, 
          {
            "speaker": "id_guolizhuo", 
            "time": "14:30-15:15"
          }, 
          {
            "time": "14:45-15:00", 
            "topic": "Tea Break"
          }, 
          {
            "time": "15:00-17:15", 
            "topic": "【Work Shop】take computer by yourself"
          }, 
          {
            "time": "17:15-17:30", 
            "topic": "Ending, Lottery, Taking photo"
          }
        ], 
        "name": "breakout venue 4: Python Session for Women"
      }
    ], 
    "buy_ticket_url": "http://www.huodongxing.com/event/7451673665100?td=8211933664158", 
    "city_icon": "beijing_icon.png", 
    "city_name": "Beijing", 
    "description": "<p>In recent years, Python has excellent performance in the fields of Internet, artificial intelligence, scientific computing, game, cloud computing, big data, devops, and enterprise software. </p>\n<p>PyCon is a global technology conference for the Python language community. PyCon China is an Annual meeting of Python, which licensed by PyCon and hosted by CPyUG(Chinese Python User Group). In the past 7 years, it has successfully held more than 20 times in Beijing, Shanghai, Guangzhou, Zhuhai, Hangzhou, Suzhou, Xi'an and Hefei. </p>\n<p>The  8th China Python Developers Conference PyCon China 2018 is sponsored by PyChina.org, organized by 30 organizers from CPyUG / TopGeek and nearly 150 volunteers in Beijing, Shanghai, Shenzhen, Hangzhou and Chengdu. It will commit to  the development and application of various Python-related technologies in the fields of Internet and enterprise applications. </p>\n<p>With the rapid development of big data and artificial intelligence, Python brings huge opportunities to developers.</p>\n<p>Each Pythoner has their own PyCon conference in mind, and the organizing committee of the conference is also working on a conference that will help Pythoner. So this year —— in the 8th year of PyCon China, we will break the past conventions and welcome all developers who are committed to promoting Python technology to join our organizing committee, lecturers, and volunteers. Together with the famous Python experts and enthusiastic Python promotion ambassadors to promote the Python language and its latest applications to the whole society. Let us work together to make the PyCon conference become an big party of gathering and sharing of experiences and achievements for pythoners once a year.</p>\n<p>The main venue of PyCon China 2018 is located in Beijing, because Beijing is the most concentrated city of Pythoners. We will try our best to meet the demands of Pythoners in various fields with the main venue of thousand people summit in the morning and the 5-6 breakout venue in the afternoon. At the same time, the Python special session for women was opened for the first time under the advice of Beijing core organizer Zheao Lee. </p>\n<p>Shanghai, Hangzhou, Shenzhen and Chendu are the breakout venues. We will coordinate and arrange the specific sharing schedules according to the application situation of subject, the willingness of everyone to participate, and the local characteristics.</p>\n<p>In the case where the lecturer and the venue are mature, we welcome Pyhoners from other regions to launch the PyCon conference, in order to making more Pythoners talk and share together, and making more people understand, recognize, use Python and become experts. </p>\n", 
    "detail_url": "city_beijing.html", 
    "donators": [
      {
        "avatar": "personal.png", 
        "name": "Mxuan_小错"
      }, 
      {
        "avatar": "personal.png", 
        "name": "Silence.M"
      }, 
      {
        "avatar": "personal.png", 
        "name": "Cynthia Xin"
      }, 
      {
        "avatar": "personal.png", 
        "name": "kavin"
      }, 
      {
        "avatar": "personal.png", 
        "name": "朱明放"
      }, 
      {
        "avatar": "personal.png", 
        "name": "蔡琪明"
      }
    ], 
    "intro": "Python Language Features | Machine Learning & Big Data Session | Web Session ( Web Development / Network Security / Crawler / SDK / API Design ) | Python Session for Women", 
    "speakers": {
      "id_Lusheng": {
        "avatar": "lecturer_lvlusheng.png", 
        "intro": "Python Backend Developer at day, Rustacean at night. Author of PyO3, active in the Python community and the Rust community, also enthusiastic and hardworking in open source enthusiast.", 
        "name": "Lusheng Lv", 
        "title": "Ant Financial Backend development", 
        "topic": {
          "preview": "This topic will share the current status and ideas for useing Rust code in Python.", 
          "title": "How to use Rust in Python"
        }
      }, 
      "id_changhui": {
        "avatar": "lecturer_changhui.png", 
        "intro": "She has provided consulting and delivery services for microservices and website construction at home and abroad. I am good at testing drive development and software architecture evolution. Passionate about technology, passionate about agile practices, and a practitioner of continuous delivery.", 
        "name": "Hui Chang", 
        "title": "Consultant of ThoughtWorks", 
        "topic": {
          "preview": "Building a website is a very fulfilling thing. In the eyes of most people who are interested in driving development, the simple use of Python and its components is complicated by the fact that each module is built into a complete set of solutions. Now that OAuth2.0 and OIDC are standard, is it useful to integrate an identity authentication module into a website? AWS provides some good ideas on development costs, development cycles, and controllability. So, how should we use building blocks to build web applications step by step? Stay tuned.", 
          "title": "What can be done with Python — Implement a web application that includes an identity authentication module"
        }
      }, 
      "id_chenxiaoyou": {
        "avatar": "lecturer_chenxiaoyou.png", 
        "intro": "Xiaoyou Chen, founder of Shanghai Wayne Kailuan Software Technology Co., Ltd., has worked as a quantitative trader and fund manager in large-scale quantitative private equity funds and developed the vn.py quantitative trading framework, which is currently one of the world''s largest open source quantitative trading projects (Github Star 6071).  His current focus is mainly on development of quantitative trading systems in the blockchain and digital currency sectors.", 
        "name": "Xiaoyou Chen", 
        "title": "Founder of Shanghai Wayne Kailuan Software Technology Co., Ltd.", 
        "topic": {
          "preview": "The new asset types (digital currency and vouchers) brought about by the blockchain technology revolution and its decentralized infrastructure are bringing dramatic changes to the global asset management industry. With its mature large-scale financial application background and active and active user community, the Python language has become the preferred solution in the blockchain asset management business. This presentation aims to share the application of Python in the various ecological aspects of blockchain asset management and to explore future directions.", 
          "title": "Python in Blockchain Asset Management"
        }
      }, 
      "id_cuiqingcai": {
        "avatar": "lecturer_cuiqingcai.png", 
        "intro": "Qingcai Cui, master of Beihang University, author of 《Python3网络爬虫开发实战》, Blog bloggers of cuiqingcai.com, the number of blog reading about Crawler has exceeded one million, Big Data Engineer of Microsoft China, lecturer of  Tianshan Intelligent and Netease Cloud Classroom, and currently engaged in the research of conversational chat direction.", 
        "name": "Qingcai Cui / Jingmi", 
        "title": "Big Data Engineer of Microsoft China", 
        "topic": {
          "preview": "This presentation will introduce the knowledge and skills of using Python for web crawler development in five aspects: crawling, parsing, storing, anti-climbing, and acceleration. It introduces how to take different measures to efficiently capture data in different scenarios, including Web crawling, App crawling, data storage, agent purchasing, verification code cracking, distributed crawling and management, intelligent parsing, etc., and also introduce some commonly used toolkits in combination with different scenarios. All of the speech content are the summary of the experience of the speaker since the web crawler research process.", 
          "title": "Robust and efficient web crawler"
        }
      }, 
      "id_dengliangju": {
        "avatar": "lecturer_dengliangju.png", 
        "intro": "He has been working for more than 5 years, focusing on the Python technology stack server architecture design and framework development. He used to be the R&D engineer of the Lea cloud computing PaaS platform and the head of the data department of Cheetah Mobile AILab. He is currently the director of engineering of the metasota. In the spare time, he often exchange ideas and guide new people in the technical community with Python developers.", 
        "name": "Liangju Deng", 
        "title": "metasota / Director of Engineering", 
        "topic": {
          "preview": "The development of Web technology has been quite complicated so far. The related projects are “small and no internal, and they are nothing short”. Various front and rear end frames and middlewares are numerous and numerous. Many introductory developers have even worked for three or five years, limited to the use of a certain two frameworks, and regarded their own fancy framework as a standard. They are only skilled in the interface after the framework is packaged. Why does the framework exist and why in that design? When encountering difficult problems, and how to solve and optimize, it is not enough. This topic is based on the history of Web technology development, helping listeners to clearly understand the role and key points of Web-related core technologies, so that they can have clear goals and clear ideas when solving various problems encountered in learning work in the future. ", 
          "title": "Taking history as a guide: Understand the Web core technology system in half an hour"
        }
      }, 
      "id_eziomelotti": {
        "avatar": "lecturer_eziomelotti.png", 
        "intro": "Ezio Melotti is a software engineer with almost 20 years of experience in software development and programming with several different languages. Born in Milan (Italy), he decided to move to Turku (Finland) in the year 2007, where he graduated and then taught at the Turku University of Applied Sciences. In 2009 he became CPython Core Developer and contributed over 1000 changesets over the years. He is also the maintainer of the bug tracker and the html package and did extensive work on the test suite, on the documentation, and on the standard library.", 
        "name": "Ezio Melotti", 
        "title": "CPython Core Developer", 
        "topic": {
          "preview": "Python is an open-source language where everyone can contribute.  Over the years the workflow used by both contributors and core developers changed dramatically, from patches sent via email to pull requests sent on GitHub.  With this talk I want to unveil what currently happens ''behind the scenes'' of CPython and how you can get involved and be part of the open source community that allows Python to be one of the most popular programming languages.", 
          "title": "The Development Process of CPython"
        }
      }, 
      "id_gashero": {
        "avatar": "lecturer_gashero.png", 
        "intro": "He started learning Python in 2005 and have shared millions of words of Python notes and translated documents. Former Tudou Assistant Architect, former Crust Network Founding Technical Director, former deepglint engineer, former RoboTerra Software Engineering Director. Fans of Radio/model/robot.", 
        "name": "Gashero", 
        "title": "Independent developer", 
        "topic": {
          "preview": "This speech will systematically introduce the causes of GIL and the side effects it brings. And bring a complete set of solutions to properly circumvent GIL to better improve the performance of Python online.", 
          "title": "New Pose of Unlock GIL"
        }
      }, 
      "id_guolizhuo": {
        "avatar": "lecturer_guolizhuo.png", 
        "intro": "He joined IT in 2000 and has been engaged in communication/network security for a long time. He has passed the qualifications of well-known foreign companies, also participated in the entrepreneurial boom. He is working on an information security company currently. In his spare time, he is committed to popularizing Python programming, making Python a tool that everyone can use, organizing multiple Python public interest qq groups, and spreading introductory courses through live broadcast. H e is interested in quantitative investment, and experienced losses in stocks, futures, cryptocurrencies and other varieties, and focused on fund investment, risk reduction, and stable income gradually.", 
        "name": "Leezhuo Guo", 
        "title": "IT Veteran / Fan of Python", 
        "topic": {
          "preview": "Add extra protection to yourself by means of fixed investment<br/>\n1.What is the automatic investment plan (AIP)?<br/>\n2.Advantages of the automatic investment plan (AIP)<br/>\n3.Shortcomings of the automatic investment plan (AIP)<br/>\n4.Advantage about programmers do the automatic investment plan (AIP)<br/>\n5.How to make automatic investment plan (AIP) with Python\n", 
          "title": "What about our pension?"
        }
      }, 
      "id_heshiyou": {
        "avatar": "lecturer_heshiyou.png", 
        "intro": "Start-up & Architect @ Guangzhou, China CTO @ ifanr.com, in charge of cloud.minapp.com, a serverless platform designed for miniprogram apps.Art lover / addicted in creative activities.", 
        "name": "Ernest He", 
        "title": "CTO of ifanr", 
        "topic": {
          "preview": "In recent years, PWA and miniprogram become more and more popular in app developments; in the mean while BaaS and FaaS also be loved by more and more developers. In this session, the speaker will introduce how ifanr team build a serverless platform which designed for miniprogram developers, using Python and Django.", 
          "title": "Form 0-1, create a Serverless platform by using Python"
        }
      }, 
      "id_hexiangyu": {
        "avatar": "lecturer_hexiangyu.png", 
        "intro": "updating", 
        "name": "Xiangyu He", 
        "title": "Python engineer of TCL Internet Division", 
        "topic": {
          "preview": "Python is a programming language with multiple inheritance capabilities. In object-oriented inheritance, the invocation of methods is closely related to the order of inheritance. Python uses the C3 linearization algorithm to calculate the MRO as the only criterion for the method call sequence, and understanding MRO can help us in Python object-oriented programming.", 
          "title": "Understand of Python MRO"
        }
      }, 
      "id_hongqiangning": {
        "avatar": "lecturer_hongqiangning.png", 
        "intro": "founder and CTO of einplus, has been programming for more than 30 years, 12 years of experience in the Internet industry, and currently in the commercial dialogue robot entrepreneurship. Former Chief Architect of Douban and Chief Architect of CreditEase Big Data Innovation Center. A veteran Python developer who is one of the founders of the Chinese Python User Group (CPUG). He is the first full-time employee of Douban, and responsible for the system architecture. He has experienced the process of watercress from 100,000 to hundreds of millions of PVs, and has accumulated a profound experience in large-scale website architecture. He has led the construction of Douban internal PaaS system DAE and Credit Suisse financial container cloud Lain, with rich experience in container cloud and microservice architecture. His current focus is on chatbot, cloud computing, container technology, microservices, and security technologies.", 
        "name": "Qiangning Hong", 
        "title": "Founder and CTO of einplus", 
        "topic": {
          "preview": "缺", 
          "slide": null, 
          "title": "My Python Road (tentative)"
        }
      }, 
      "id_kongtaoxun": {
        "avatar": "lecturer_kongtaoxun.png", 
        "intro": "Taoxun Kong / K0r4dji, CSO of Beijing Ding Niu Technology Co., Ltd., founder of Breaking Security Team, which is a famous information security team in domestic, book expert consultant of People Post Press-Asynchronous Community-Information security field.", 
        "name": "Taoxun Kong/K0r4dji", 
        "title": "Chief security officer(CSO) of digapis", 
        "topic": {
          "preview": "With the increasing number of Internet attacks, network information security has gradually attracted people's attention. Python has become the most popular programming language for hackers. Whether it is network attack or defense or software cracking, Python is very simple to help security personnel accomplish many things, such as: automation Attacks, etc. Through this topic, you can learn about Python's things in the information security field.", 
          "title": "Chief security officer(CSO) of digapis"
        }
      }, 
      "id_lihui": {
        "avatar": "lecturer_lihui.png", 
        "intro": "The author of Python Web Development with Flask.", 
        "name": "Grey Li", 
        "title": "member of Pallets Team", 
        "topic": {
          "preview": "As a popular Python web framework, many developers like Flask''s simplicity and flexibility, and often compare it to bulky Django. Based on these characteristics, we can say that Flask is free, and free Flask will make your web development more free. Specifically, the free here is manifested in many aspects, including the extension of program functions, the definition of routes, the organization of project structures, and the design of program patterns.", 
          "title": "The Free Flask"
        }
      }, 
      "id_lijinhong": {
        "avatar": "lecturer_lijinhong.png", 
        "intro": "Jinhong Lee, main engineer of Code doctor studio, founder of the big snake intelligence, chief artificial intelligence scientist of Beijing Pai Network Software, has released two video tutorials on the CNTK deep learning framework, has published two best-selling books, 《深度学习之Tensorflow：入门、进阶与实战》and《python带我起飞：入门、进阶、商业实战》.", 
        "name": "Jinhong Lee", 
        "title": "Main engineer of Code doctor", 
        "topic": {
          "preview": "1.Basic knowledge and trends of artificial intelligence<br/>\n2.Picture classification and fine-tuning practical case<br/>\n3.Face recognition direction practical case<br/>\n4.Numerical analysis direction practical case<br/>\n", 
          "title": "Artificial Intelligence Case Study Sharing - Image "
        }
      }, 
      "id_lilong": {
        "avatar": "lecturer_lilong.png", 
        "intro": "Leo Lee (debugtalk), DebugTalk Blogger, the author of HttpRunner. 7 years‘ experience in software testing industry, heavy Python enthusiasts, always committed to Python in software testing field of application and promotion. Embracing the Zen of Python, pursuiting of simplicity and elegance in code, as well as in life. Currently in DJI is responsible for testing and development work.", 
        "name": "Leo Lee(debugtalk)", 
        "title": "Leader of DJI test developement", 
        "topic": {
          "preview": "1. Python's ecology in the field of software testing<br/>\n2. The birth background of HttpRunner<br/>\n3. The development and design ideas of HttpRunner<br/>\n4. Automated test program based on HttpRunner<br/>\n5. Successful practice case based on HttpRunner\n", 
          "title": "Build an enterprise-level automated testing framework HttpRunner with Python open source ecosystem"
        }
      }, 
      "id_nightynight": {
        "avatar": "lecturer_nightynight.png", 
        "intro": "From MSRA, has very deep research on features and underlying of Python language", 
        "name": "nightynight", 
        "title": "MSRA", 
        "topic": {
          "preview": "Extend the use of cpython vm through metaprogramming to improve code reuse rate, abstract ability and runtime program execution efficiency. Also to introduce How to introduce JIT and type checking tools in a compatible cpython ecosystem.", 
          "title": "Implementation ideas of Python JIT"
        }
      }, 
      "id_qinxuye": {
        "avatar": "lecturer_qinxuye.png", 
        "intro": "His main job is to combine the Python ecosystem with the big data environment. The past work involved writing the pyodps DataFrame framework, which allows users to write code similar to pandas, but supports execution on MaxCompute bi data platforms, pandas, and traditional databases. His current work is mainly Mars, which is a matrix-based unified computing framework. Its goal is to bring the PyData ecosystem to a distributed execution environment. Currently, it supports the Numpy interface and can perform multidimensional array operations in a distributed environment. It supports running on the GPU. And supports two-dimensional sparse matrices. Pandas and scikit-learn will be distributed in the future.", 
        "name": "Xuye Qin", 
        "title": "Computing Platform Department of Alibaba", 
        "topic": {
          "preview": "Mars - Matrix-based unified computing framework, the goal to bring the ecology of PyData to a distributed execution environment, currently supports the Numpy interface, can perform multidimensional array operations in a distributed environment, it supports running on the GPU, and supports two-dimensional sparse matrices. Currently, Mars is compatible with 70% of the common Numpy interfaces. This sharing session introduces our current work, introduces Mars'' implementation principles, and looks ahead to future superstructures including DataFrame and machine learning.", 
          "title": "Mars - Matrix-based unified computing framework"
        }
      }, 
      "id_wangshun": {
        "avatar": "lecturer_wangshun.png", 
        "intro": "Python/Go/C++ developer, responsible for the landing and best practices of cloud computing, big data and deep learning technologies in large enterprises. He has worked for artificial intelligence unicorn Face++ and AWS, Oracle and other companies. The main architecture and developer of the face recognition system for the coffee-free unmanned convenience store, AWS Big Data Expert EMR Subject Matter Expert.", 
        "name": "Shun Wang", 
        "title": "Cloud Advisor of Google", 
        "topic": {
          "preview": "1.Introduction of TPU;<br/>\n2.A tutorial of training/inference a DL/ML model on Google TPUv2 2.1 example 1, 2.2 example 2;<br/>\n3.Difference between TPUv2 and GPU and trouble shooting of TPUv2. 4 Benchmark of TPUv2 and GPU<br/>\n", 
          "title": "Cooking with Google TPUv2: How to train and deploy your models on Google Cloud."
        }
      }, 
      "id_yaogangqiang": {
        "avatar": "lecturer_yaogangqiang.png", 
        "intro": "Joined Zhihu in 2013, he was the head of the home feed stream engineering technology. During the project of the feed stream, the response time P95 was reduced from 1.6s to 700ms through the optimization of the framework. The stability was improved from 99.9% to 99.99% through the development specification. Responsible for the Community Architecture Group in 2018, leading the team to rewrite the main business modules with Golang, saving machine resources 75%", 
        "name": "Gangqiang Yao", 
        "title": "Technical Leader of Community Division of Zhihu", 
        "topic": {
          "preview": "updating", 
          "title": "Subject to be determined"
        }
      }, 
      "id_yizhe": {
        "avatar": "lecturer_yizhe.png", 
        "intro": "One of the executors of the AI Empowerment Program, working as a guest lecturer in cloud computing and big data related fields in several universities in Shanghai, first contact with Python in 10 years, and fully embraced Python and deepened the data science community in 15 years.", 
        "name": "Yizhe", 
        "title": "PING AN / Data scientist", 
        "topic": {
          "preview": "1. The overall evolution and architecture of the data science platform from 0 to 1<br/>\n2. 0.25 era - \"Python + Hive + Shell\" mixed programming to solve the cumbersome human ETL<br/>\n3. 0.5 era - \"Django+ElasticSearch\" increased customer search and BI analysis support<br/>\n4. 0.75 era - \"Django+PyHive+PySpark\" increases the operation and machine learning task flow of big data clusters<br/>\n5. 1.0 era - Scheduler scheduling integration and platform, cluster micro-service<br/>\n6. Various external technical resistances and pitfalls encountered in the evolution path from 0 to 1<br/>\n7. Summary and outlook'\n", 
          "title": "Evolution Path of Enterprise Data Science Platform Based on Python Ecosphere"
        }
      }, 
      "id_zhangjintao": {
        "avatar": "lecturer_zhangjintao.png", 
        "intro": "Jintao Zhang, senior devops developer of NetEase, responsible for construction of containerization and automated operation and maintenance system.", 
        "name": "Jintao Zhang", 
        "title": "Senior Devops of NetEase", 
        "topic": {
          "preview": "With the formation of ecosystems such as containerization and cloud native, the value of CI/CD in the software development process is becoming more and more prominent. More and more companies need to transform and optimize this, but thousands of people have thousands of faces, transformations and practices often have many problems, both in the personnel and in the tool chain. This time is mainly to share the best practices we have summarized in production, and to analyze the problems encountered in this process, and to share in detail the technical details, as well as the optimization, problem analysis, and architecture in the process and the reflections and conclusions we have made, I hope that everyone can inspire them and promote their respective development in the production environment.", 
          "title": "CI/CD Practice Based on Docker"
        }
      }, 
      "id_zhangxiang": {
        "avatar": "lecturer_zhangxiang.png", 
        "intro": "updating…", 
        "name": "Xiang Zhang", 
        "title": "CPython Core Developer", 
        "topic": {
          "preview": "This speech will share the most frequently encountered problems in CPython development and the tools for debugging problems in your own work scenario; also, it will talk the thinking about Python debugging and monitoring in future.", 
          "title": "What happened to my Python process?"
        }
      }, 
      "id_zhaowentian": {
        "avatar": "lecturer_zhaowentian.png", 
        "intro": "Beijing University of Posts and Telecommunications - Network Information Security Winter Camp - Senior Lecturer, Guangzhou University - Network Information Security Summer Camp - Senior Lecturer, Domestic Famous Information Security Research Team - Core Member of Dawning Team, Beijing Mingyuan University - Network Space Advanced Technology College - Senior Lecturer, Freebuf-DigApis Information Security Column Leader", 
        "name": "Wentian Zhao", 
        "title": "Penetration Test Engineer of DigApis", 
        "topic": {
          "preview": "Briefly introduce modules and functions that involve cryptography in Python", 
          "title": "Python application in cryptography"
        }
      }, 
      "id_zhouxiaomao": {
        "avatar": "lecturer_zhouxiaomao.png", 
        "intro": "Working as development manager in iRain Parking, also worked in Hangzhou Hikvision. After working, he has been engaged in embedded software development, mainly involving camera sensor driver development, intelligent access control system development and intelligent parking lot software development.", 
        "name": "Xiaomao Zhou", 
        "title": "Development Manager of iRain Parking", 
        "topic": {
          "preview": "This speech focuses on the work experience of speecher and illustrates the practical use of Python in the embedded software development process. The speech details will be divided into the following sections<br/>\n1. What is included in embedded development, including development of driver layer and application layer.<br/>\n2. What Python can do in embedded development. Python can be used in embedded development of application layer, including background web development, instant communication development, GUI development, etc.<br/>\n3. Compare the advantages of Python development over traditional embedded development.<br/>\n4. Briefly explain the basic process of embedded development using Python, and mainly explain the construction process of Python development environment.<br/>\n5. Finally, showing the specific application intelligent parking system management display and PLC communication read and write operation display. \n", 
          "title": "Application of Python in embedded system development"
        }
      }
    }, 
    "time": "<b>Time</b>：2018.10.14", 
    "tips": "<b>Conference schedule</b><p>2018.10.14 （ * Due to venue restrictions, no lunch will be offered at this conference.）</p>", 
    "title": "beijing", 
    "volunteers": [
      {
        "avatar": "chenshixin.png", 
        "description": "PyChina发起人 / Ahaschool-CTO", 
        "name": "陈世欣", 
        "voltitle": "北京站 | 组委"
      }, 
      {
        "avatar": "dama.png", 
        "description": "优势眼动-合伙人 / PyChina发起人", 
        "name": "大妈", 
        "voltitle": "北京站 | 组委"
      }, 
      {
        "avatar": "lizheao.png", 
        "description": "闪银奇异-高级Python开发 / 北京组委负责人", 
        "name": "李者璈", 
        "voltitle": "北京站 | 组委"
      }, 
      {
        "avatar": "dengliangju.png", 
        "description": "秘塔科技-工程总监 / Python工程化应用专场负责人", 
        "name": "邓良驹", 
        "voltitle": "北京站 | 组委"
      }, 
      {
        "avatar": "laixintao.png", 
        "description": "蚂蚁金服-SRE / 北京Python语言特性专场负责人", 
        "name": "赖信涛", 
        "voltitle": "北京站 | 组委"
      }, 
      {
        "avatar": "shiyuankun.png", 
        "description": "英特尔软件工程师 / Python创新应用专场负责人", 
        "name": "石元坤", 
        "voltitle": "北京站 | 组委"
      }, 
      {
        "avatar": "hexiangyu.png", 
        "description": "TCL互联网事业部-Python工程师 / 北京核心组织者", 
        "name": "何翔宇", 
        "voltitle": "北京站 | 组委"
      }, 
      {
        "avatar": "qianzhangnian.png", 
        "description": "创盛视联数码科技（北京）有限公司-研发经理 / 北京核心组织者", 
        "name": "钱章年", 
        "voltitle": "北京站 | 组委"
      }
    ]
  }, 
  "city_chengdu": {
    "address": "<b>Address</b>：(Sichuan, Chengdu)Southwest Jiaotong University (Xipu Campus), No. 999, Xi'an Road, Yaodu District", 
    "agenda": [
      {
        "detail": [
          {
            "time": "13:00-13:30", 
            "topic": "签到 / 暖场介绍"
          }, 
          {
            "speaker": "id_luoqihan", 
            "time": "13:30-14:15"
          }, 
          {
            "speaker": "id_zhouxiaomao", 
            "time": "14:15-15:00"
          }, 
          {
            "time": "15:00-15:15", 
            "topic": "茶歇"
          }, 
          {
            "speaker": "id_qinxuye", 
            "time": "15:15-16:00"
          }, 
          {
            "speaker": "id_lizheao", 
            "time": "16:00-16:45"
          }, 
          {
            "speaker": "id_liguojian", 
            "time": "16:45-17:00"
          }, 
          {
            "time": "17:00-17:15", 
            "topic": "抽奖，合影，交流"
          }
        ], 
        "name": "The main venue"
      }
    ], 
    "buy_ticket_url": "http://www.huodongxing.com/go/pyconcd2018", 
    "city_icon": "chengdu_icon.png", 
    "city_name": "Chengdu", 
    "description": "<p>「和我在成都的街头走一走，走到灯都熄灭了也不停留」赵雷来了又走了，《人间成都》在朋友圈火了又淡下去了。唯独 PyCon China 似乎遗忘了成都。</p> <p>但是这一次，我们来了。PyCon China 2018 ChengDu 将在10月27日在蓉举办。这一次，PyCon China 会带上一丝来自西南的火锅气。</p> <p>所以，有兴趣吗？来聊聊大家感兴趣的话题，不管是你是想分享自己在各种领域应用 Python 的最佳实践，亦或者是想安安静静的当一个听众，我们成都的开发者都会给你扎起场子（此处请用四川话）</p> <p>拜水都江堰，问道青城山，科华北路吃晚饭，也许这次还可以来犀浦交大参个会？好了，10.27 我们不见不散。</p> <p>诶，对了，要是您公司有兴趣来赞助我们，或者请大家吃个火锅，喝个茶，茶馆里搓个麻将的话，可以联系我们市场负责人 Cynthia Xin （辛庆）：微信号：18516094658</p> <p>PyCon 是全球Pythonista最盛大的年度聚会，由 PSF(Python 基金会)支持，致力于营造愉快的、多元化的Python技术主题大会。PyCon China是由 CPyUG (华蠎用户组)获得授权举办的中国 PyCon 年会。无论您使用哪种编程语言, 都欢迎来参加这场完全由 Python 中国社区组织的欢乐集会;-)</p> <p>现在，PyCon 2018 成都站 活动将于2018年10月27日（星期六下午）举行。</p>", 
    "detail_url": "city_chengdu.html", 
    "donators": null, 
    "intro": "", 
    "speakers": {
      "id_liguojian": {
        "avatar": "lecturer_liguojian.png", 
        "intro": "", 
        "name": "Guojian Li", 
        "title": "贝壳金服房产金融数据部研发负责人", 
        "topic": {
          "preview": "...", 
          "slide": null, 
          "title": ""
        }
      }, 
      "id_lizheao": {
        "avatar": "lecturer_lizheao.png", 
        "intro": "", 
        "name": "Zheao Li", 
        "title": "Manjusaka/闪银奇异高级 Python 开发", 
        "topic": {
          "preview": "...", 
          "slide": null, 
          "title": ""
        }
      }, 
      "id_luoqihan": {
        "avatar": "lecturer_luoqihan.png", 
        "intro": "", 
        "name": "Qihan Luo", 
        "title": "ThoughtWorks软件开发工程师", 
        "topic": {
          "preview": "...", 
          "slide": null, 
          "title": ""
        }
      }, 
      "id_qinxuye": {
        "avatar": "lecturer_qinxuye.png", 
        "intro": "", 
        "name": "Xuye Qin", 
        "title": "阿里巴巴计算平台事业部技术专家", 
        "topic": {
          "preview": "...", 
          "slide": null, 
          "title": ""
        }
      }, 
      "id_zhouxiaomao": {
        "avatar": "lecturer_zhouxiaomao.png", 
        "intro": "", 
        "name": "Xiaomao Zhou", 
        "title": "西安艾润物联开发经理", 
        "topic": {
          "preview": "...", 
          "slide": null, 
          "title": ""
        }
      }
    }, 
    "time": "<b>Time</b>：2018.10.27", 
    "tips": "<b>大会日程</b><p>2018年10月27日 （ * 因为场地限制，本次大会将不提供午餐）</p>", 
    "title": "chengdu", 
    "volunteers": [
      {
        "avatar": "liuliu.png", 
        "description": "高级工程师", 
        "name": "刘柳", 
        "voltitle": "开源爱好者"
      }, 
      {
        "avatar": "lizheao.png", 
        "description": "闪银奇异-高级 Python 开发", 
        "name": "李者璈", 
        "voltitle": "Manjusaka"
      }
    ]
  }, 
  "city_hangzhou": {
    "address": "<b>Address</b>：(Zhejiang, Hangzhou)4th Floor, Block B, Nokia Global R&D Center, NO.567, Xincheng Road, Binjiang District", 
    "agenda": [
      {
        "detail": [
          {
            "time": "09:00 - 09:30", 
            "topic": "签到"
          }, 
          {
            "time": "09:30 - 10:00", 
            "topic": "开场致辞"
          }, 
          {
            "speaker": "id_lifeng", 
            "time": "10:00 - 10:45"
          }, 
          {
            "speaker": "id_jinbihui", 
            "time": "10:45 - 11:30"
          }, 
          {
            "time": "11:30 - 13:30", 
            "topic": "中午休息"
          }, 
          {
            "speaker": "id_qinxuye", 
            "time": "13:30 - 14:15"
          }, 
          {
            "speaker": "id_kongxiaoquan", 
            "time": "14:15 - 15:00"
          }, 
          {
            "time": "15:00 - 15:15", 
            "topic": "休息 - 自由交流时间"
          }, 
          {
            "speaker": "id_wangbinxin", 
            "time": "15:15 - 16:00"
          }, 
          {
            "time": "16:00 - 17:00", 
            "topic": "圆桌论坛 - Pythonista 从入坑到大牛成长之路"
          }, 
          {
            "time": "17:00 - 17:10", 
            "topic": "抽奖，拍照留影"
          }
        ], 
        "name": "The main venue"
      }
    ], 
    "buy_ticket_url": "http://www.huodongxing.com/go/pycon2018hangzhou?td=8211933664158", 
    "city_icon": "hangzhou_icon.png", 
    "city_name": "Hangzhou", 
    "description": "<p>各位小伙伴，是否依稀记得去年的PyCon2017杭州的活动，“人生苦短，Python是岸”。对我们组织者而言，这就像昨天刚刚发生过的事情。2017年PyCon杭州，有超过300位的参会者，多个精彩的话题分享，线下持续精彩的讨论，这一切都是那么的奇妙。</p> <p>PyCon 是全球 Pythoneer 最盛大的年度聚会，由 PSF(Python 基金会)支持，致力于营造愉快的、多元化的 Python 技术主题大会。PyConChina 是由 CPyUG(华蠎用户组)获得授权举办的中国 PyCon 年会。无论您使用哪种编程语言, 都欢迎来参加这场完全由Python中国社区组织的欢乐集会;-)</p> <p>现在，PyCon 2018杭州站 活动将再次举行。此次活动地点依旧相约在老地方——诺基亚杭州全球研发中心，活动将于2018年11月4日（星期日全天）举行。</p>", 
    "detail_url": "city_hangzhou.html", 
    "donators": null, 
    "intro": "", 
    "speakers": {
      "id_jinbihui": {
        "avatar": "lecturer_jinbihui.png", 
        "intro": "主要从事机器学习/深度学习的建模，应用机器学习/深度学习分析公司软件产生的log，提高软件产品开发维护的效率。并任deeplearning.ai课程Sequence Models助教。", 
        "name": "Bihui Jin", 
        "title": "诺基亚贝尔 机器学习工程师", 
        "topic": {
          "preview": "<p>分享应用机器学习对海量已分析的软件运行产生的log进行学习，实现对未分析log进行机器自动分析归类，提高调查问题的效率的解决方案以及技术架构，涉及大数据带来的数据存储，计算机内存，特征提取效率，模型训练效率的挑战。</p> <p>方案基于诺基亚Cloud，S3以及GPU等资源，应用了spark，tensorflow等framework，以python为主要开发语言，分享使用python在机器学习工程处理大数据的思考与挑战。</p>", 
          "slide": null, 
          "title": "Log Analysis: Machine Learning With Dig Data"
        }
      }, 
      "id_kongxiaoquan": {
        "avatar": "lecturer_kongxiaoquan.png", 
        "intro": "从事自然语言处理两年多，有丰富的理论和实践经验。目前在吉利集团旗下车联网公司从事车载人机交互系统的研发工作，曾在阿里巴巴集团从事自然语言相关的框架和算法开发工作。", 
        "name": "Xiaoquan Kong", 
        "title": "亿咖通 研发工程师", 
        "topic": {
          "preview": "自然语言处理（Natural Language Processing, NLP）作为人工智能领域的一个重要分支，现在已经成为人工智能研究、创业和落地的热点方向。本次分享将从理论和实践结合的角度，介绍 NLP 的理论、实现和流程，同时将介绍 Python 环境下重要的工业级开源框架：SpaCy 和 RASA NLU，并提供针对中文场景的具体建议。", 
          "slide": null, 
          "title": "Python 环境下的自然语言处理"
        }
      }, 
      "id_lifeng": {
        "avatar": "lecturer_lifeng.png", 
        "intro": "先后就职于Motorola, Samsung, Alibaba, EMC, Citrix等IT公司，现为自由职业者。熟悉基于ARM+Linux的嵌入式软件平台架构, 在甲骨文JavaME, 高通BREW, 摩托罗拉P2K，谷歌Android，三星Tizen等移动平台上具备十余年研发经验。\n\n近几年主要从事云计算相关研发工作，在数据中心软硬件架构，软件定义存储，虚拟化，信息安全，高性能网络等技术领域积累了一定的经验。\n是《灰帽黑客 第4版：正义黑客的道德规范、渗透测试、攻击方法和漏洞分析技术 》一书中文版的主要译者： http://product.dangdang.com/23927890.html 对技术创新具有浓厚的兴趣和实践能力，热心参与开源社区的各种活动，多次参加各种IT会议并作技术分享", 
        "name": "Feng Li", 
        "title": "自由职业者", 
        "topic": {
          "preview": "1) GraalVM简介及Python在OpenJDK开发中的重要作用 2) 深入分析GraalPython的实现 3) 重新思考和设计Python运行时 4) 在开源ARM平台（如树莓派/96Boards等）上实践GraalPython/GraalVM", 
          "slide": null, 
          "title": "GraalPython--新的Python运行时"
        }
      }, 
      "id_qinxuye": {
        "avatar": "lecturer_qinxuye.png", 
        "intro": "主要工作是将 Python 生态和大数据环境进行结合。过去工作包含编写了 pyodps DataFrame 框架，这个框架能让用户编写类似 pandas 的代码，但支持在 MaxCompute 大数据平台、pandas 和传统数据库上执行。现在的工作主要是 Mars，这是一个基于矩阵的统一计算框架，目标把 PyData 的生态带到分布式执行环境，目前支持 Numpy 接口，能在分布式环境执行多维数组操作，它支持在 GPU 上运行，且支持二维稀疏矩阵。未来会将 pandas 和 scikit-learn 分布式化。", 
        "name": "Xuye Qin", 
        "title": "阿里巴巴计算平台事业部 技术专家", 
        "topic": {
          "preview": "基于矩阵的统一计算框架 Mars，目标把 PyData 的生态带到分布式执行环境，目前支持 Numpy 接口，能在分布式环境执行多维数组操作，它支持在 GPU 上运行，且支持二维稀疏矩阵。目前，Mars 兼容 70% 常见 Numpy 接口。本次分享会介绍目前我们的工作，会介绍 Mars 的实现原理，并且对未来的上层建筑包括 DataFrame 和机器学习进行展望。", 
          "slide": null, 
          "title": "Mars——基于矩阵的统一计算框架"
        }
      }, 
      "id_wangbinxin": {
        "avatar": "lecturer_wangbinxin.png", 
        "intro": "开源图书《Python 最佳实践指南》中文版译者、开源Python跨平台工具库“pydu”作者，Python热爱者和工作者。从事过采控平台设计、Agent开发、测试工具开发和项目管理等工作。", 
        "name": "Binxin Wang", 
        "title": "阿里云 高级开发工程师", 
        "topic": {
          "preview": "在对外发行 Python 应用时，我们可能出于个人或商业的保密要求，需要加密源码。主流的加密方式有发行 .pyc 文件、混淆源码、使用 Cython 编译等。本次分享将简单介绍现有加密方式的优点与不足，再重点介绍如何基于对称加密和非对称加密算法定制 Python 解释器，从而达到加解密源码的目的。", 
          "slide": null, 
          "title": "Python 源码加密"
        }
      }
    }, 
    "time": "<b>Time</b>：2018.11.04", 
    "tips": "<b>大会日程</b><p>2018年11月04日 （ * 大会议程可能因为不可抗拒力进行调整，请以大会当体现场流程为准。）</p>", 
    "title": "hangzhou", 
    "volunteers": [
      {
        "avatar": "yemin.png", 
        "description": "自动化测试架构师", 
        "name": "叶敏", 
        "voltitle": "诺基亚贝尔"
      }, 
      {
        "avatar": "wangbinxin.png", 
        "description": "高级开发工程师", 
        "name": "Eric", 
        "voltitle": "阿里云"
      }, 
      {
        "avatar": "zhanghongda.png", 
        "description": "大数据视觉开发工程师", 
        "name": "张宏柯", 
        "voltitle": "点我达"
      }, 
      {
        "avatar": "laixintao.png", 
        "description": "SRE", 
        "name": "赖信涛", 
        "voltitle": "蚂蚁金服"
      }
    ]
  }, 
  "city_shanghai": {
    "address": "<b>Address</b>：(Shanghai, Putuo)2nd Floor, Shanghai No.1 Art Hotel (in the Mengqing Park), No.130, Yichang Road, Putuo District", 
    "agenda": [
      {
        "detail": [
          {
            "time": "08:00～08:50", 
            "topic": "Check-in"
          }, 
          {
            "time": "08:50～09:00", 
            "topic": "开场介绍"
          }, 
          {
            "time": "09:00～09:45", 
            "topic": "【机器智能的局限，从图像识别到自然语言处理】王晓雷 - ThoughtWorks - 算法科学家"
          }, 
          {
            "time": "09:45～10:30", 
            "topic": "【PyTorch入门指北】张校捷 - 英伟达 - 深度学习架构工程师"
          }, 
          {
            "time": "10:30～10:45", 
            "topic": "茶歇"
          }, 
          {
            "time": "10:45～11:30", 
            "topic": "【扩展Jupyter/IPythonNB，赋能你的云服务】丁来强 - 阿里云日志服务 - 上海团队负责人"
          }, 
          {
            "time": "11:30～11:45", 
            "topic": "【Python - Machine Learning vs Human Learning】（快速演讲）Jiyoon Lim - Coupang Data Analyst"
          }, 
          {
            "time": "11:45 ～ 13:00", 
            "topic": "午餐（大会提供工作快餐）"
          }, 
          {
            "time": "13:00 ～ 13:45", 
            "topic": "【Python从头实现以太坊】 - Jon - Yield.IM 创始人"
          }, 
          {
            "time": "13:45 ～ 14:30", 
            "topic": "【 区块链资产管理中的Python】陈晓优 - 上海韦恩开猿软件科技有限公司创始人"
          }, 
          {
            "time": "14:30 ～ 14:45", 
            "topic": "茶歇"
          }, 
          {
            "time": "14:45 ～ 15:30", 
            "topic": "【Type Hints 最佳实践】张佳圆 - 爱奇艺 - 后端开发工程师"
          }, 
          {
            "time": "15:30 ～ 16: 45", 
            "topic": "【 Python 文化中的接口和协议】- 赖信涛 - 蚂蚁金服 - SRE"
          }, 
          {
            "time": "16:45 ～ 17:00", 
            "topic": "【使用numba优化python代码】-吴江-易安信 - 资深工程师"
          }, 
          {
            "time": "17:00 ～ 17:15", 
            "topic": "【Pyenv 从入门到放弃——Python 多版本多环境实战】丁俊豪 - 上海绿岸网络科技 - DevOps"
          }, 
          {
            "time": "17:15 ～ 17:30", 
            "topic": "抽奖，拍照，留念"
          }
        ], 
        "name": "2018年10月21日"
      }
    ], 
    "buy_ticket_url": "http://www.huodongxing.com/event/5453261623411", 
    "city_icon": "shanghai_icon.png", 
    "city_name": "Shanghai", 
    "description": "<p>Running around in the years, experiencing the vicissitudes of life,we grew up and become more matured unwittingly.</p>\n<p>During the year, we didn't dare to idle, and the annual Python Developers Conference has been prepared to show in a new look.</p>\n<p>Last year, nearly 10 lecturers had a heated discussion with the participants around the  frontier topic of  big data and artificial intelligence.This year, we will continue to lead the way in the cutting-edge technology and add more wonderful sharing of areas where Python can do more, such as Web development, network security, Web Crawler, operations, testing, and so on.</p>\n<p>Slow down, do you think that's all? No, Since it is a conference about Python, we will return to the essence of the language .We will talk about the industrial application of the new features in new versions of Python and  the solutions of  Python multi-version, multi-environment coexistence that plague many development and operations engineers. Inspire interest and hit the pain point.</p>\n<p>Having said that much, here comes the three major philosophical questions :when and where, how to sign up? (Who am I? Where am I from? Where will I go?)</p>\n<p>The event will be held on October 21st, 2018 (Sunday), let us meet at the 2nd floor of No.1 Art Hotel. Address: No. 130, Yichang Road, Putuo, Shanghai (in the MengQingYuan Park).</p>\n<p>You or your company are welcome to sponsor this conference, sponsors' rights and details, please contact: cynthiaxin1@gmail.com</p>\n<p>PyCon is the world's largest annual gathering of Pythoneers, supported by the PSF (Python Foundation), dedicated to creating a delightful and diverse Python technology theme conference. PyConChina is a  PyCon Annual Conference in China ,authorized by CPyUG. No matter which programming language you use, you are welcome to participate this big fun event organized by the Python Chinese community.</p>\n", 
    "detail_url": "city_shanghai.html", 
    "donators": null, 
    "intro": "", 
    "speakers": {
      "id_chenxiaoyou": {
        "avatar": "lecturer_zhangxiaoyou.png", 
        "intro": "Founder of Shanghai Wayne Kailuan Software Technology Co., Ltd., ever served as a quantitative trader and fund manager in large-scale quantitative private equity funds, developed the vn.py quantitative trading framework, which is currently one of the world's largest open source quantitative trading projects ( Github Star 6071). The current work focus is on the development of quantitative trading systems in the blockchain and digital currency sectors.", 
        "name": "Xiaoyou Chen", 
        "title": "Founder of Shanghai Wayne Kailuan Software Technology Co., Ltd.", 
        "topic": {
          "preview": "Theme introduction:The new asset types (digital currency and vouchers) brought about by the blockchain technology revolution, as well as its decentralized infrastructure, are bringing dramatic changes to the global asset management industry. With its mature large-scale financial application background and active user community, Python language has become the preferred solution in the blockchain asset management business. This presentation aims to share the application of Python in the various ecological aspects of blockchain asset management and to explore future directions.", 
          "title": "Python in blockchain asset management"
        }
      }, 
      "id_dingjunhao": {
        "avatar": "lecturer_dingjunhao.png", 
        "intro": "The web name of the speechmaker is ITXiaoPang. He's the founder of the open source sky website. He has been programming since 2003.He is familiar with many languages, but loves Python only. Currently working on Python's operation and maintenance in a well-known game company.", 
        "name": "Junhao Ding", 
        "title": "iwgame</br>DevOps", 
        "topic": {
          "preview": "- Python multi-version, multi-environment coexistence analysis</br>\n- traditional solutions</br>\n- Pyenv advantage</br>\n- Did you install Pyenv right?</br>\n- Best practices of Pyenv</br>\n", 
          "title": "Pyenv, from entry to giving up - Python multi-version multi-environment combat"
        }
      }, 
      "id_dinglaiqiang": {
        "avatar": "lecturer_dinglaiqiang.png", 
        "intro": "Worked as an architect in Splunk (the first purely data-listed company on NASDAQ in the US)  and being in this field for 10+ years, Mr. Ding has a wide range of technical interests. He shared 5 well received topics at the PyCon 2015/2016 conference, covering the Big data analysis and Processing visualization, Python functional programming / design pattern, Python big data scheduling engine, Pythin core injection technology and other topics, etc.", 
        "name": "Laiqiang Ding", 
        "title": "Alibaba Cloud's log service</br>Shanghai team leader", 
        "topic": {
          "preview": "Jupyter (IPython Notebook) is cool and popular. Except for All-takenism, it seems difficult to extend Jupyter? This topic is an easy-to-understand example of how to extend Jupyter to link your cloud services, optimize the output of services, and make Jupyter smarter for your projects and customers.", 
          "title": "Extend Jupyter/IPythonNB to empower your cloud service"
        }
      }, 
      "id_jiyoonlim": {
        "avatar": "lecturer_jiyoonlim.png", 
        "intro": "Work as a Data Analyst at an SCM Data Science team at an ecommerce company. The team analyze everything related to SCM plus some of FC related topics. Getting to use and learning about Python on a daily basis has been a great experience!", 
        "name": "Jiyoon Lim", 
        "title": "Coupang</br>Data Analyst", 
        "topic": {
          "preview": "The topic of my speech is about the comparison between a non-Pythonic way and a Pythonic way of approaching business problems. As I switched from a business side to a technical field, I have experienced how two sides differ in solving business problems. I will cover the actual problems needed to be solved on FC Network Analysis using K-Means and how pro Excel users would approach this problem.", 
          "title": "Python - Machine Learning vs Human Learning"
        }
      }, 
      "id_jon": {
        "avatar": "lecturer_jon.png", 
        "intro": "Continuous entrepreneurs, more than 10 years experience in Web application architecture, mainly writing Python/Rust/JavaScript/Haskell language, Ethereum early fans and evangelists, open source software supporters. The current focus is on blockchain payment projects. Yield.IM", 
        "name": "Jon", 
        "title": "Founder", 
        "topic": {
          "preview": "The goal of using Python to implement Ethereum from scratch is to disassemble the Ethereum \"rocket\", to find out, and then reassemble it with Python. Our focus is not on recreating an Ethereum, but on getting an experience in the process. This series can be roughly divided into four chapters, namely P2P network protocol, blockchain structure, consensus calculation and the smart contract. This topic explores the P2P network protocol component, and we will try to connect to the Ethereum network and communicate smoothly in python.", 
          "title": "realizes Ethereum with Python from scratch"
        }
      }, 
      "id_laixintao": {
        "avatar": "lecturer_laixintao.png", 
        "intro": "", 
        "name": "Xintao Lai", 
        "title": "Ant Financial</br>Site Reliability Engineer", 
        "topic": {
          "preview": "Why is the length of the object being len() instead of obj.length() ? What is the difference between an iterator and an iterable object? Why do we rarely use design patterns when writing Python code? Behind this it is the idea of \"protocol\" in the Python language. This talk will discuss how to understand the protocol in Python, what is the design idea, and how to write Python code to implement this idea.", 
          "title": "Interfaces and protocols in the Python culture"
        }
      }, 
      "id_wangxiaolei": {
        "avatar": "lecturer_wangxiaolei.png", 
        "intro": "Wang Xiaolei, the chief algorithmic scientist of the China Consulting team, has provided data and algorithm related consulting services in  many domestic and overseas projects for a lot of companies, including banks and insurance companies, financial services institutions, real estate advertising companies, consumer goods companies, educational service organizations, and communication technology companies. It mainly includes mathematical modeling and optimization, unstructured data processing, natural language processing, image recognition, etc. It has end-to-end experience in human-computer interaction and precision marketing, and truly realizes the value of customized mining data.", 
        "name": "Xiaolei Wang", 
        "title": "ThoughtWorks</br>Algorithm scientist", 
        "topic": {
          "preview": "AI is math. Though we do not have to prove something mathematically when creating a deep neuro network, we are using statistical methods to learn the patterns from the data. Unsurprisingly, we've done some unseen assumption behind the model that will never lead to the result that an intelligence could understand and generalize about the world. Today we are going to discuss about the limitations of machine intelligence based on some real world projects, from image recognition to natural language processing, about both data and models. </br>\n</br>\nTo python players, this talk may answer the following questions:</br>\n1. How to know whether my problem can be solved by Artificial Intelligence today? </br>\n2. How to design the indictors for a real-life problem? </br>\n3. How to know if a model is 'good enough'? </br>\n4. How much data is enough to train a model? </br>\n5. Tips and tricks when using Python for deep learning. </br>\n", 
          "title": "Speech topic: Limitations of machine intelligence, from image recognition to natural language processing"
        }
      }, 
      "id_wujiang": {
        "avatar": "lecturer_wujiang.png", 
        "intro": "Responsible for web backend development in the Mozy group, Mr. Jiang has many Experience in the development and optimization of high-traffic Web backends for many years.", 
        "name": "Jiang Wu", 
        "title": "EMC Senior Engineer", 
        "topic": {
          "preview": "Because of the dynamic type, Python's performance has always been a headache. The release of Python3 did not bring performance improvements. The performance of pypy's interpreter that supports jit is still not good enough. This presentation will use a performance test code  to show the optimization step by step and show the tuning process, explaining how to optimize the performance of Python code with numba and cython, as fast as Go.", 
          "title": "Optimize the python code with numba"
        }
      }, 
      "id_zhangjiayuan": {
        "avatar": "lecturer_zhangjiayuan.png", 
        "intro": "Now working as a backend development engineer (Python) at iQiyi, 4 years of Python coding experience, and mainly use Python for web development at work. In this PyCon, Mr. Zhang will share some experience of using Type HInts in real projects.", 
        "name": "Jiayuan Zhang", 
        "title": "IQIYI</br>Backend development engineer", 
        "topic": {
          "preview": "1. Introduction to type system, comparison of static type and dynamic type</br>\n2. What is Type Hints</br>\n3. Why do I need to use Type Hints?</br>\n4.Some ways to use Type Hints</br>\n5. Some problems with Type Hints and the improvements in Python 3.7</br>\n6. How to start with Type Hints in a real project</br>\n7. Continuous integration of mypy for type checking</br>\n8. The future of Type HInts, CPython runtime optimization? JIT?</br>\n", 
          "title": "Type Hints Best Practices"
        }
      }, 
      "id_zhangxiaojie": {
        "avatar": "lecturer_zhangxiaojie.png", 
        "intro": "Now working as a deep learning architecture engineer at NVIDIA, he is responsible for the optimization of GPU-based deep learning models. The main application scenario of the  Python at work is to build the deep learning model. The main deep learning frameworks used are PyTorch and TensorFlow. Hope to share  the experience on PyTorch's with everyone in PyCon.", 
        "name": "Xiaojie Zhang", 
        "title": "Nvidia</br>Deep learning architecture engineer", 
        "topic": {
          "preview": "1. Introduction to PyTorch</br>\nIntroducing the characteristics of PyTorch dynamic graphs, and comparing PyTorch with other deep learning frameworks.</br>\n2. Introduction to new features of PyTorch (mainly for version 0.4)</br>\nIntroducing the new features of PyTorch 0.4 (which may include 1.0 if 1.0 is released) to help the programmers migrate the code to the new version.</br>\n3. How to build a simple neural network using PyTorch</br>\nIntroducing the simple use of PyTorch (use of nn.Module)</br>\n4. PyTorch's parallel training</br>\nDescribing how to use the multi-GPU to train the PyTorch model (using the apex library)</br>\n5. Deploy PyTorch model with ONNX</br>\nDescribing how to solidify the model with the ONNX format and deploy the model on Caffe2</br>\n6.Tips on PyTorch</br>\nIntroducing the various pits that you may encounter when writing PyTorch</br>\n7. Summary</br>\n", 
          "title": "Getting started with PyTorch"
        }
      }
    }, 
    "time": "<b>Time</b>：2018.10.21", 
    "tips": "<b>大会日程</b><p>2018年10月21日 （ * 因为场地限制，本次大会将不提供午餐）</p>", 
    "title": "shanghai", 
    "volunteers": [
      {
        "avatar": "zhangxiaojie.png", 
        "description": "深度学习架构工程师", 
        "name": "张校捷", 
        "voltitle": "NVIDIA"
      }, 
      {
        "avatar": "shiyuankun.png", 
        "description": "软件工程师", 
        "name": "石元坤", 
        "voltitle": "英特尔"
      }, 
      {
        "avatar": "dinjunhao.png", 
        "description": "DevOps", 
        "name": "丁俊豪/挨踢小胖", 
        "voltitle": "赛可出行"
      }, 
      {
        "avatar": "huzhiqiang.png", 
        "description": "工程师", 
        "name": "胡志强", 
        "voltitle": "西部期货邮箱公司"
      }, 
      {
        "avatar": "zhangzhijun.png", 
        "description": "技术总监", 
        "name": "张志军/water", 
        "voltitle": "复星有叻信息科技公司"
      }
    ]
  }, 
  "city_shenzhen": {
    "address": "<b>Address</b>：(Guangdong, Shenzhen)3rd Floor, Shenzhen Kexing Science Park International Conference Center, NO.15,  Keyuan Road, Nanshan District", 
    "agenda": [
      {
        "detail": [
          {
            "time": "08:30～08:50", 
            "topic": "签到"
          }, 
          {
            "time": "08:50～09:00", 
            "topic": "暖场介绍"
          }, 
          {
            "speaker": "id_lilong", 
            "time": "09:00～09:45"
          }, 
          {
            "speaker": "id_heshiyou", 
            "time": "09:45～10:30"
          }, 
          {
            "speaker": "id_hejian", 
            "time": "10:30～11:15"
          }, 
          {
            "speaker": "id_river4", 
            "time": "11:15～12:00"
          }, 
          {
            "time": "12:00～13:00", 
            "topic": "午间休息"
          }, 
          {
            "speaker": "id_dama", 
            "time": "13:00～13:45"
          }, 
          {
            "speaker": "id_chenshaoshen", 
            "time": "13:45～14:30"
          }, 
          {
            "time": "14:30～14:45", 
            "topic": "休息 - 武术表演"
          }, 
          {
            "speaker": "id_huangyi", 
            "time": "14:45～15:30"
          }, 
          {
            "speaker": "id_zhuyehua", 
            "time": "15:30～16:15"
          }, 
          {
            "speaker": "id_anqur", 
            "time": "16:15～17:00"
          }, 
          {
            "time": "17:00 - 17:10", 
            "topic": "会议结束，抽奖，合影"
          }
        ], 
        "name": "The main venue"
      }
    ], 
    "buy_ticket_url": "http://www.huodongxing.com/go/pycon2018sz", 
    "city_icon": "shenzhen_icon.png", 
    "city_name": "Shenzhen", 
    "description": "<p>来了就是深圳人，来了就是Pythoneer！ PyCon又要在深圳与大家见面了. 近年来随着大数据，AI等技术的发展，一向低调的python已经逐渐坐上了编程语言的第一把交椅．在这座诞生了华为，腾讯等一线互联网公司的城市里，或许下一个风口就诞生于Python,诞生于PyCon的交流中．希望与你相约于PyCon深圳，不管是以讲师的睿智，还是听众的热情，让我们认识那个卓尔不凡的你．</p> <p>PyCon 是全球Pythonista最盛大的年度聚会，致力于营造愉快的、多元化的Python技术主题大会。PyCon China是由 CPyUG(华蠎用户组)获得授权举办的中国PyCon年会。无论您使用哪种编程语言, 都欢迎来参加这场完全由Python中国社区组织的欢乐集会;-)</p> <p>现在，PyCon 2018 深圳站 活动将于2018年10月27日（星期六全天）举行。</p>", 
    "detail_url": "city_shenzhen.html", 
    "donators": null, 
    "intro": "", 
    "speakers": {
      "id_anqur": {
        "avatar": "lecturer_anqur.png", 
        "intro": "Python 爱好者, 关注系统编程领域. 14 年蟒营接触 Python 至今, 本科毕业第一个月的新工程狮一枚, 珠海 GDG 活跃分子. ", 
        "name": "Anqur", 
        "title": "华为 网络产品开发工程师", 
        "topic": {
          "preview": "在异步编程领域 Python 有着十几年的经验和积累, 从 asyncore, futures 到 tasks, coroutines, Python 3.x 的异步能力围绕着 asnycio 在近几年内迅猛提升. 本演讲主题从一个极小的疑问发起, 浅谈协程与事件循环在 Python 中的联系与实践。", 
          "slide": null, 
          "title": "浅谈 Python 事件循环与协程"
        }
      }, 
      "id_chenshaoshen": {
        "avatar": "lecturer_chenshaoshen.png", 
        "intro": "2009年毕业于哈尔滨工程大学硕士学位。曾就职于诺基亚，华为等公司，2013年初加入深圳花果山科技有限公司工作至今。爱好编程，中医，传统武术等。", 
        "name": "Shaoshen Chen", 
        "title": "深圳花果山科技有限公司技术总监", 
        "topic": {
          "preview": "以一个 Pythoneer 的角度见证一个电商5年的沉浮发展，分享在此过程中如何利用各种开源方案解决性能优化，如何在不断变化的业务与不断调整的商业模型中为公司提供高效的工具让其处于有利的竞争地位。探讨80后程序员在不断发展的形势面前如何保持自己的竞争力，如何组建自己的团队，如何健康的生活。", 
          "slide": null, 
          "title": "Python 在中小电商的应用与实践"
        }
      }, 
      "id_dama": {
        "avatar": "lecturer_dama.png", 
        "intro": "<p>江湖人称大妈的大妈 Pythoneer ;-)</p> <p>Python 中文社区创始人 / 管理员,热心于python社区的公益事业,大家熟知的社区\"大妈\";OBP及蟒营工程设计者 /主持人;参与并主持各种线上 / 线下活动,主持编撰了 \"可爱的Python\";坚持用 Pythonic 感化国人进入 FLOSS世界进行学习 / 分享 / 创造!</p>", 
        "name": "Zoom.Quiet", 
        "title": "北京优视眼动科技 CTO", 
        "topic": {
          "preview": "", 
          "slide": null, 
          "title": "但行好事 莫问前程"
        }
      }, 
      "id_hejian": {
        "avatar": "lecturer_hejian.png", 
        "intro": "十多年IT从业经验，从技术到金融，从金融到风控，从风控到互联网，从互联网到咨询。不断走出舒适区，体验多维的人生。", 
        "name": "Jian He", 
        "title": "ThoughtWorks 咨询师 前互联网金融公司CTO", 
        "topic": {
          "preview": "由于种种原因，很多时候说到微服务貌似使用的语言只有 Java，其实微服务的初衷是希望不同的服务能够根选择自己擅长或者喜欢的语言来开发。这个话题就想聊聊用 Python 怎么微服务，主要内容有为什么要使用 Python 来做微服务，使用 Python 如何设计一个微服务架构，有了架构在实现的时候如何编写 Python 微服务，最后简单介绍一下在部署微服务的时候应该注意些什么。希望通过这个话题能够让大家能够建立一个 Python 微服务的体系，在某些场景下能够利用 Python 的优势快速实现基于微服务架构的应用。", 
          "slide": null, 
          "title": "只能用 Java 做微服务？Python 也可以"
        }
      }, 
      "id_heshiyou": {
        "avatar": "lecturer_heshiyou.png", 
        "intro": "爱范儿 CTO、知晓云负责人，大学开始创业，先后参与过多个创新创业项目。资深移动互联网应用专家，擅长架构设计，专注云计算、机器学习及移动开发。", 
        "name": "Shiyou He", 
        "title": "爱范儿 CTO", 
        "topic": {
          "preview": "近年来，应用形态逐渐朝着 PWA、小程序等范客户端形态发展；云计算则朝着 BaaS + FaaS 的 Serverless 无服务架构大步迈进。本次分享向大家介绍爱范儿团队在用 Python 打造小程序领域的 Serverless 平台知晓云的过程中遇到的挑战和收获，以及对接下来的云计算形态的展望。", 
          "slide": null, 
          "title": "用 Python 打造 Serverless 平台，从 0 到 1"
        }
      }, 
      "id_huangyi": {
        "avatar": "lecturer_huangyi.png", 
        "intro": "10多年的老 Pythoneer，从事过 Web 前后端，手游前后端，游戏引擎开发，杂七杂八的编程语言，从码农到 CTO。近年来深入研究区块链相关技术。", 
        "name": "Huangyi", 
        "title": "风雷互动 CTO", 
        "topic": {
          "preview": "- 使用 Python 开发并实现Cardano（区块链）项目。 - 对比 Python 和 Haskell 语言在区块链项目方面的特点。 - 介绍 Cardano 项目本身的开发细节。", 
          "slide": null, 
          "title": "Python 和公链开发"
        }
      }, 
      "id_lilong": {
        "avatar": "lecturer_lilong.png", 
        "intro": "李隆（debugtalk），DebugTalk 博主，HttpRunner 作者。7年软件测试行业经历，重度 Python 爱好者，始终致力于 Python 在软件测试领域的应用和推广。信奉 Python 之禅，追求代码的简洁和优雅，于人生亦然。当前在大疆创新负责测试开发方面的工作。", 
        "name": "Long Li", 
        "title": "(debugtalk） 大疆创新测试 开发负责人", 
        "topic": {
          "preview": "- Python 在软件测试领域的生态 - HttpRunner 的诞生背景 - HttpRunner 的开发设计思路 - 基于 HttpRunner 的自动化测试方案 - 基于 HttpRunner 的成功实践案例", 
          "slide": null, 
          "title": "借助 Python 开源生态打造企业级自动化测试框架（HttpRunner）"
        }
      }, 
      "id_river4": {
        "avatar": "lecturer_river4.png", 
        "intro": "优趣天下创始人，全球最流行的安卓 Python 应用 QPython 作者，前Zynga高级开发工程师、前绿盟科技产品经理、前新浪邮件高级开发工程师。", 
        "name": "river4", 
        "title": "优趣天下 创始人", 
        "topic": {
          "preview": "通过分享在安卓上移植编译 Python 的实践经验与大家一起深入 Python 这个软件工程的结构设计，以及如何阅读 Python 源码，甚至扩展 Python 代码。 涵盖的内容包括 - 在安卓平台运行 Python 的意义 - 安卓平台与标准 Linux 平台的一些共同点和差异 - 编译工具链的方案及一些问题 - Python 代码结构 - 怎么运营一个基于编程工具的社区", 
          "slide": null, 
          "title": "安卓上编译 Python 实践笔记"
        }
      }, 
      "id_zhuyehua": {
        "avatar": "lecturer_zhuyehua.png", 
        "intro": "斯坦福大学计算机科学专业，虚拟化和云计算专家，拥有多项云计算研发专利。曾任职全球数据存储行业龙头企业EMC技术总监等", 
        "name": "Ed Zhu", 
        "title": "深圳领脉科技 CEO", 
        "topic": {
          "preview": "深度学习框架下维护聊天助手个性一致的技术框架，很明显还可以衍生出很多种其他方案，但是技术思路应该是类似的，核心思想是把聊天助手的个性信息在Decoder 阶段能够体现出来，以达到维护个性一致的目的。", 
          "slide": null, 
          "title": "用 Python 和深度学习构建下一代聊天机器人"
        }
      }
    }, 
    "time": "<b>Time</b>：2018.10.27", 
    "tips": "<b>大会日程</b><p>2018年10月27日 （ * 女性 Pythoneer 注意啦，本次大会将会为女同胞准备特别惊喜，不要忘记向志愿者索取哦。）</p>", 
    "title": "shenzhen", 
    "volunteers": [
      {
        "avatar": "spawnris.png", 
        "description": "PyChina 发起人", 
        "name": "Spawnris", 
        "voltitle": "深圳站 | 组委"
      }, 
      {
        "avatar": "liuzhijun.png", 
        "description": "高级Python开发工程师", 
        "name": "刘志军", 
        "voltitle": "有宝科技有限公司"
      }, 
      {
        "avatar": "shenshaoshen.png", 
        "description": "技术总监", 
        "name": "陈绍琛", 
        "voltitle": "深圳花果山科技有限公司"
      }, 
      {
        "avatar": "daishaofei.png", 
        "description": "高级 Python 开发工程师", 
        "name": "代少飞", 
        "voltitle": "小橙奔跑"
      }
    ]
  }, 
  "lang": "en", 
  "lang_dir": "en", 
  "lang_suffix": "_en", 
  "nav": [
    {
      "title": "HOME", 
      "url": "en/index.html"
    }, 
    {
      "children": [
        {
          "title": "BEIJING__10.14", 
          "url": "en/city_beijing.html"
        }, 
        {
          "title": "SHANGHAI__10.21", 
          "url": "en/city_shanghai.html"
        }, 
        {
          "title": "SHENZHEN__10.27", 
          "url": "en/city_shenzhen.html"
        }, 
        {
          "title": "CHENGDU__10.27", 
          "url": "en/city_chengdu.html"
        }, 
        {
          "title": "HANGZHOU__11.04", 
          "url": "en/city_hangzhou.html"
        }
      ], 
      "title": "SCHEDULE"
    }, 
    {
      "children": [
        {
          "title": 2011, 
          "url": "http://cn.pycon.org/2011/", 
          "url_external": 1
        }, 
        {
          "title": 2012, 
          "url": "http://cn.pycon.org/2012/", 
          "url_external": 1
        }, 
        {
          "title": 2013, 
          "url": "http://cn.pycon.org/2013/", 
          "url_external": 1
        }, 
        {
          "title": 2014, 
          "url": "http://cn.pycon.org/2014/en/index.html", 
          "url_external": 1
        }, 
        {
          "title": 2015, 
          "url": "http://cn.pycon.org/2015/en/index.html", 
          "url_external": 1
        }, 
        {
          "title": 2016, 
          "url": "http://cn.pycon.org/2016/en/index.html", 
          "url_external": 1
        }, 
        {
          "title": 2017, 
          "url": "http://cn.pycon.org/2017/en/index.html", 
          "url_external": 1
        }
      ], 
      "title": "HISTORY"
    }, 
    {
      "children": [
        {
          "title": "Beijing", 
          "url": "https://shimo.im/docs/QgPUss7mLQYTOjWe/read", 
          "url_external": 1
        }, 
        {
          "title": "Shanghai", 
          "url": "https://shimo.im/docs/snRnlx0NWCA2zuG7/read", 
          "url_external": 1
        }, 
        {
          "title": "Shenzhen", 
          "url": "https://shimo.im/docs/Y0483j9UztooVYaQ/read", 
          "url_external": 1
        }, 
        {
          "title": "Chengdu", 
          "url": "https://shimo.im/docs/qkxFxjQgLzMyjl7W/read", 
          "url_external": 1
        }, 
        {
          "title": "Hangzhou", 
          "url": "https://shimo.im/docs/M0m31oLndqYdoXMc/read", 
          "url_external": 1
        }
      ], 
      "title": "Conference"
    }, 
    {
      "title": "ORGANIZER", 
      "url": "en/organizer_detail.html"
    }, 
    {
      "title": "SPEAKER", 
      "url": "en/speaker_detail.html"
    }, 
    {
      "title": "SPONSER", 
      "url": "en/support_detail.html"
    }, 
    {
      "language": "zh-cn", 
      "title": "中文", 
      "url": "index.html"
    }
  ], 
  "site": {
    "base_url": "..", 
    "button_buy": "Buy Now", 
    "button_details": "Details", 
    "home_url": "./en/", 
    "title_donator": "Donator", 
    "title_history": "History", 
    "title_schedule": "Schedule", 
    "title_speaker": "Speaker", 
    "title_sponsor": "Sponsor", 
    "title_support": "sponser", 
    "title_volunteer": "Volunteer", 
    "to_be_speaker": "To be Speaker", 
    "to_be_speaker_url": "https://jinshuju.net/f/fjOUqZ", 
    "to_be_volunteer": "To be Volunteer", 
    "to_be_volunteer_url": ""
  }, 
  "sponsors": {
    "assist": [
      {
        "intro": "ThoughtWorks", 
        "link": "https://www.thoughtworks.com", 
        "logo": "support_thoughtworks.png"
      }
    ], 
    "book": [
      {
        "intro": "Turing Education", 
        "link": "https://www.ituring.com.cn", 
        "logo": "support_turing.png"
      }, 
      {
        "intro": "BroadView", 
        "link": "https://www.broadview.com.cn", 
        "logo": "support_broadview.png"
      }, 
      {
        "intro": "Asynchronous Community", 
        "link": "https://www.epubit.com", 
        "logo": "support_epubit.png"
      }, 
      {
        "intro": "华章科技", 
        "link": "http://www.hzmedia.com.cn", 
        "logo": "support_hzbooks.png"
      }
    ], 
    "bronze": [
      {
        "intro": "Einplus", 
        "link": "https://www.einplus.cn", 
        "logo": "support_einplus.png"
      }, 
      {
        "intro": "BXB", 
        "link": "", 
        "logo": "support_bxb.png"
      }
    ], 
    "community": [
      {
        "intro": "Juejin", 
        "link": "https://juejin.im", 
        "logo": "support_juejin.png"
      }, 
      {
        "intro": "GitChat", 
        "link": "https://gitbook.cn", 
        "logo": "support_gitchat.png"
      }, 
      {
        "intro": "Open Source China", 
        "link": "https://www.oschina.net", 
        "logo": "support_oschina.png"
      }, 
      {
        "intro": "DBAplus", 
        "link": "https://dbaplus.cn", 
        "logo": "support_dbaplus.png"
      }, 
      {
        "intro": "Qianfeng Education", 
        "link": "https://www.mobiletrain.org", 
        "logo": "support_mobiletrain.png"
      }, 
      {
        "intro": "知晓云", 
        "link": "https://cloud.minapp.com", 
        "logo": "support_zhixiaoyun.png"
      }, 
      {
        "intro": "创客猫", 
        "link": "https://www.chuangkem.com", 
        "logo": "support_chuangkemao.png"
      }, 
      {
        "intro": "Mockplus", 
        "link": "http://www.mockplus.cn/", 
        "logo": "support_mockplus.png"
      }
    ], 
    "meta": [
      {
        "level": "organizer", 
        "name": "Organizer", 
        "style": "big"
      }, 
      {
        "level": "silver", 
        "name": "Silver", 
        "style": "inline"
      }, 
      {
        "level": "bronze", 
        "name": "Bronze", 
        "style": "inline"
      }, 
      {
        "level": "support", 
        "name": "Special", 
        "style": "inline"
      }, 
      {
        "level": "assist", 
        "name": "Assist", 
        "style": "big"
      }, 
      {
        "level": "book", 
        "name": "Book", 
        "style": "inline"
      }, 
      {
        "level": "video", 
        "name": "Video", 
        "style": "inline"
      }, 
      {
        "level": "signup", 
        "name": "Registration platform", 
        "style": "inline"
      }, 
      {
        "level": "community", 
        "name": "Community partners", 
        "style": "inline"
      }
    ], 
    "organizer": [
      {
        "intro": "PyChina", 
        "link": "https://pychina.org", 
        "logo": "support_pychina.png"
      }
    ], 
    "signup": [
      {
        "intro": "Accuvally", 
        "link": "https://www.huodongxing.com", 
        "logo": "support_huodongxing.png"
      }
    ], 
    "silver": [
      {
        "intro": "GeTui", 
        "link": "https://www.getui.com/", 
        "logo": "support_getui.png"
      }
    ], 
    "support": [
      {
        "intro": "Nokia上海贝尔", 
        "link": "https://www.nokia-sbell.com", 
        "logo": "support_nokiasbell.png"
      }, 
      {
        "intro": "西南交通大学信息科学与技术学院", 
        "link": "", 
        "logo": "support_sistswjtu.png"
      }, 
      {
        "intro": "西南交通大学中美青年创客交流中心", 
        "link": "", 
        "logo": "support_swjtu.png"
      }
    ], 
    "video": [
      {
        "intro": "CC视频", 
        "link": "https://www.bokecc.com", 
        "logo": "support_bokecc.png"
      }, 
      {
        "intro": "OTPUB", 
        "link": "http://www.otpub.com", 
        "logo": "support_otpub.png"
      }
    ]
  }, 
  "support_detail": {
    "supports": [
      {
        "description": "PyChina创立于2014年，是由CpyUG(华蟒用户组)获得授权举办的中国PyCon年会，以推动各地Python线下活动和在线活动等为宗旨。", 
        "logo": "support_pychina.png", 
        "name": "PyChina"
      }, 
      {
        "description": "GeTui (Zhejiang Merit Interactive Network Technology Co., Ltd.) is an independent provider of big data technology and artificial intelligence services, and is committed to driving industries forward through data intelligence. GeTui focuses on providing developer services, targeted mobile marketing, and big data applications in industries such as financial industry, smart tourism and public services.", 
        "logo": "support_getui.png", 
        "name": "GeTui"
      }, 
      {
        "description": "爱因互动专注于为企业提供售前领域的商用对话机器人，用友好、自然的人机沟通方式提升用户体验，促进销售转化。以 NLP、知识工程和个性化推荐技术为依托，我们深度结合行业相关知识和领域模型，为重点客户定制专属解决方案，提供高价值服务、降低销售和客服成本，提升达到销售转化率和用户满意度的目标。", 
        "logo": "support_einplus.png", 
        "name": "Einplus"
      }, 
      {
        "description": "The vn.py open source community is one of the largest open source communities which focus on Python and Quantitative Trading in China. The community members mainly come from Financial and IT sectors including investment banks, hedge funds, financial brokers, data analysis firm and also other technology firms. Based on the vn.py open source quant trading framework, the community has contributed many ready-to-use open source projects for quantitative investment, algo trading and financial data analysis.", 
        "logo": "support_bxb.png", 
        "name": "BXB"
      }, 
      {
        "description": "诺基亚上海贝尔", 
        "logo": "support_nokiasbell.png", 
        "name": "Nokia上海贝尔"
      }, 
      {
        "description": "The school of Information Science & Technology (SIST) at Southwest Jiaotong University (SWJTU) has a history that was originated in 1960s, with the aim of meeting the trend of the times and the strategic demand of our country. At that time, SWJTU established three disciplines, i.e. computing technology, automation, and radio technology, becoming one of the earliest institutions in China which had electronics and information disciplines. In 1981, the discipline Computer and Its Applications was authorized as one of the first disciplines in China being able to award master degree, when there was only two in Sichuan Province. The department Computer Science and Engineering was founded in 1981, which was followed by the establishment of the School of Computer and Communications Engineering (SCCE) in 1993 (the predecessor of SIST). In 2005, the school was renamed SIST. With the solid construction and rapid development over 50 years, SIST has built a balanced and well developed disciplinary system, covering the whole area of Electronics and Information. With primary disciplines including Computer, Communications, Control and Electronics, SIST has become a base for producing IT talents and carrying out outstanding scientific research.", 
        "logo": "support_sistswjtu.png", 
        "name": "The school of Information Science & Technology (SIST) at Southwest Jiaotong University (SWJTU)"
      }, 
      {
        "description": "Southwest Jiaotong University Makerspace (SWTJU Makerspace) was founded in December 2013 to create a making space for college students to provide support for innovation and entrepreneurship. Now the space is a sub-center of SWJTU, linked to the Engineering Training Center, is China''s first three makerspace founded by university.", 
        "logo": "support_swjtu.png", 
        "name": "Innovation Center for China-U.S. Youth Exchange of Southwest Jiaotong University"
      }, 
      {
        "description": "ThoughtWorks was founded in 1993 in Chicago. There are 41 offices and more than 5,000 outstanding talents in 14 countries. A community of passionate individuals whose purpose is to revolutionize software design, creation and delivery, while advocating for positive social change.", 
        "logo": "support_thoughtworks.png", 
        "name": "ThoughtWorks"
      }, 
      {
        "description": "Beijing Turing Culture Development Co., Ltd. has always been planning and publishing high-quality science and technology books as its core business. Since its establishment, it has accumulated more than 10 million books, affecting millions of readers. Its Turing education brand is one of the high-end brands in the domestic computer book field. The Turing Community is a comprehensive service platform created by Turing, which combines the production of book content, the service of translators, the sales of e-books, and the exchange of technical people.", 
        "logo": "support_turing.png", 
        "name": "Turing Education"
      }, 
      {
        "description": "The 15-year-old Chinese-language IT book flagship brand is known as the miracle of Internet speed development in the traditional paper media publishing industry! Publishing philosophy deep cultivation of professional publishing, technology leading innovation. Over the years, it has continued to maintain strong growth, and the compound growth rate is considered to be the industry leader. The annual direct impact on the technical career of 10 million + professionals.", 
        "logo": "support_broadview.png", 
        "name": "BroadView"
      }, 
      {
        "description": "The Asynchronous Community (www.epubit.com) is a leading IT professional book community in China. It is hosted by the People's Posts and Telecommunications Publishing House and is dedicated to the publication and sharing of quality learning content, providing readers with quality learning content and online communication for readers and authors.", 
        "logo": "support_epubit.png", 
        "name": "Asynchronous Community"
      }, 
      {
        "description": "北京华章图文信息有限公司（机械工业出版社华章公司）成立于1995年，是国内第一家中外合资的出版公司。20多年来出版了《算法导论》、《编译原理》、《Java编程思想》、《深入理解计算机系统》、《点石成金：访客至上的网页设计秘笈》、等知名畅销书，累计出版图书3000多种，图书销售册数超过2000万册。", 
        "logo": "support_hzbooks.png", 
        "name": "华章科技"
      }, 
      {
        "description": "CC视频成立于2005年4月，是面向垂直行业用户打造的一站式场景化视频解决方案的服务品牌。CC视频提供基于云计算的视频云直播、云点播、云互动和云加速的整体解决方案，满足教育、金融、IT互联网、医疗、政府企业等行业用户的在线视频应用需求。CC视频连续7年在在线教育领域占有率达72%，续签服务的用户占比达84.6%。", 
        "logo": "support_bokecc.png", 
        "name": "CC视频"
      }, 
      {
        "description": "OTPUB领先IT技术在线学习&直播平台，元鼎旗下全资子公司（北京奥泰帕博科技有限公司），是国内首家与厂商直接合作的技术企业，从而获得最先进、最实用的技术资源，成为最权威的IT技术在线学习&直播平台。平台汇集各厂商及高级工程师共同制作的IT技术视频课程，与互联网最前沿与热门直播活动，以满足企业及个人在产品知识、技术应用、案例分析、产品超融合等领域的技能提升。", 
        "logo": "support_otpub.png", 
        "name": "OTPUB"
      }, 
      {
        "description": "Accuvally is an activity platform that is trusted by the organizers and loved by urban white-collar workers. It is also the industry's leading event technology service provider; it provides event venue reservations, event release, One-stop comprehensive event service, such as registration promotion, check-in ticket inspection, activity data analysis, custom assembly APP/small program, event service provider docking, etc.", 
        "logo": "support_huodongxing.png", 
        "name": "Accuvally"
      }, 
      {
        "description": "Juejin.im – Becoming a better developer by sharing and learning. We provide premium and customized content covering all technical categories to our users through data mining. We boost the adoption of new technology. Juejin has already become the most popular online community for developers in China. You can visit our website or download our mobile app. Juejin is also available as a browser extension. Our key products include Juejin Book, Juejin Translation Project, etc.", 
        "logo": "support_juejin.png", 
        "name": "Juejin"
      }, 
      {
        "description": "The Asynchronous Community (www.epubit.com) is a leading IT professional book community in China. It is hosted by the People's Posts and Telecommunications Publishing House and is dedicated to the publication and sharing of quality learning content, providing readers with quality learning content and online communication for readers and authors.", 
        "logo": "support_epubit.png", 
        "name": "Asynchronous Community"
      }, 
      {
        "description": "GitChat brings together the industry's top technology experts, is the technology elite knowledge sharing community and learning platform, to create a new concept of \"reading + communication = knowledge + social\" to meet the changing needs of IT practitioners in knowledge learning, change the way of knowledge learning.", 
        "logo": "support_gitchat.png", 
        "name": "GitChat"
      }, 
      {
        "description": "Open Source China (OSC) founded in August 2008 is the largest open source community in China. It has more than 2.3 million registered members and Alexa ranking 1400 in the world. OSC provides multiple channels including news, forum, code sharing, blogs, and translation, etc to help local developers study and utilize open soure technology.", 
        "logo": "support_oschina.png", 
        "name": "Open Source China"
      }, 
      {
        "description": "dbaplus：数据连接未来！围绕Data、Blockchain、AiOps的企业级专业社群。行业大咖、技术干货，每天精品原创文章推送，每周线上技术分享，每月线下技术沙龙，受众20W+。", 
        "logo": "support_dbaplus.png", 
        "name": "DBAPlus"
      }, 
      {
        "description": "Qianfeng Education belongs to Beijing Qianfeng Interconnection Technology Co., Ltd. It was founded in January 2011. Its headquarters is located in Beijing. At present, it has established branches in 15 cities, such as Shanghai, Shenzhen, Guangzhou and Hangzhou. Since its inception, Qianfeng has trained tens of thousands of technical personnel in Python, artificial intelligence, big data, Java, HTML5 and other fields, and has established cooperation with 10,000 IT-related enterprises in talent delivery, and is committed to building a talent service platform in the IT education industry chain.", 
        "logo": "support_mobiletrain.png", 
        "name": "Qianfeng Education"
      }, 
      {
        "description": "知晓云是国内首家专注于微信小程序开发的后端云服务，为小程序开发者提供最低门槛的 Serverless 无服务架构接入体验。它免去了小程序开发中服务器搭建、域名备案、数据接口开发、线aoxig上运维等繁琐流程，通过 BaaS（Backend As A Service）、FaaS（Function As A Service）组合而成的服务矩阵，让开发者专注于业务逻辑的实现，快速上线小程序。", 
        "logo": "support_zhixiaoyun.png", 
        "name": "知晓云"
      }, 
      {
        "description": "创客猫是活跃在创新创业第一现场的新媒体。专注为全国范围内的创新创业活动提供图文直播、现场报道、专访等服务，为创业者和产业创新者提供各行业最前沿的资讯动态。截止目前，每月邀请创客猫进行图文直播和报道的峰会已近百场，创客猫也累计专访报道了数百名创业者和知名投资人。", 
        "logo": "support_chuangkemao.png", 
        "name": "创客猫"
      }, 
      {
        "description": "Mockplus is an all-in-one tool for designers and developers to prototype mobile, web and desktop apps quickly and easily. It's developed and well-maintained by Jongde Software LLC, a fast-growing start-up on a mission to improve the user experience of prototyping magic.", 
        "logo": "support_mockplus.png", 
        "name": "Mockplus"
      }
    ]
  }
}